cask_args appdir: '/Applications'

#---------------------------------------------
# Taps
#tap 'AdoptOpenJDK/openjdk'
tap 'homebrew/homebrew-cask'
tap 'homebrew/cask-fonts'
# tap 'caskroom/versions'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# This tap is for the saml2aws formula
tap 'versent/homebrew-taps'

tap 'mongodb/brew'


#---------------------------------------------
# Binaries
brew 'ansible'
#brew 'apache2'
brew 'autoconf'
brew 'automake'
#brew 'awsebcli'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bcrypt'
brew 'brew-cask-completion'
brew 'brew-gem'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'curl-openssl'
brew 'fish'
# brew 'ffind'
# brew 'ffmpeg'
brew 'findutils'
brew 'gdb'
brew 'gem-completion'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'htop'
# brew 'httrack'
brew 'mas'
brew 'midnight-commander'
# this is a keg only version. For using this, use 
# `export PATH="/usr/local/opt/mongodb@3.0/bin:$PATH"`
# for temporary use or add
# PATH="/usr/local/opt/mongodb@3.0/bin:$PATH"
# to your ~/.bash_profile
# brew 'mongodb@3.0'	

#To have launchd start mongodb now and restart at login:
#  brew services start mongodb
#Or, if you don't want/need a background service you can just run:
#  mongod --config /usr/local/etc/mongod.conf
# brew 'mongodb'	

# this is from the tap 'mongodb/brew'

# Video player for streaming all kinds of videos
# brew 'mpv'
brew 'libgit2'
brew 'mongodb-community@3.2'
brew 'mysql@5.6'
brew 'mysql-client'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'pdf2svg'
brew 'php@7.2'
brew 'saml2aws'
# brew 'sass/sass/sass'
# brew 'node-sass'
# To run selenium, do: `selenium-server -port 4444`
# For more options: `selenium-server -help`
# For running it automatically `brew services start selenium-server-standalone`
# brew 'selenium-server-standalone'
brew 'svg2pdf'
brew 'tree'
brew 'unrar'
brew 'vagrant-completion'
# for updating outdated casks with `cask-repair <outdated_cask>`
brew 'vitorgalvao/tiny-scripts/cask-repair'
brew 'wget'
brew 'youtube-dl'
brew 'zip'

# Dev Tools and Languages
# brew 'perl'

# brew 'python@2' # Python is already 2.7.10 installed on Mac OS X Mojave and it also comes with pip so no need to install either


#---------------------------------------------
# Fonts from casks
# cask 'font-aileron'

# cask 'font-anton'
# cask 'font-freesans'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-pt-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
# cask 'font-titillium'
# # cask 'font-titillium-web'

# # Google fonts
# cask 'font-cabin'
# cask 'font-karla'
# cask 'font-oswald'
# cask 'font-news-cycle'
# # cask 'font-ruda'
# cask 'font-poppins'
# cask 'font-public-sans'

#---------------------------------------------
# applications from Casks
cask 'alfred'
cask 'adobe-acrobat-reader'
# cask 'adobe-creative-cloud'
# cask 'adobe-digital-editions'
cask 'bartender'
cask 'bettertouchtool'

# cask 'caffeine'
# cask 'calibre'
cask 'camunda-modeler'
cask 'cheatsheet'
# cask 'chromedriver-beta'
# cask 'commander-one'
# cask 'daisydisk'
cask 'dbeaver-community'
# cask 'dbschema'
cask 'diffmerge'
# cask 'docker'
# cask 'dropbox'
#cask 'duet' -> obsolete with MacOS Catalina's sidecar
# cask 'evernote'
cask 'expandrive'
cask 'firefox'
# cask 'focus'
cask 'forklift'
cask 'google-chrome' 
cask 'iterm2'
cask 'keepassx'
# cask 'keyboard-maestro'
# cask 'kindle'
# cask 'launchcontrol'
# cask 'logitech-presentation'
cask 'loom'
# cask 'magicprefs'
# cask 'mailbutler'
# cask 'menumeters'
cask 'microsoft-office'
cask 'mongodb-3'
cask 'mongodb-compass-community'

# this is a "frozen" cask 
cask 'mysqlworkbench'
# cask 'omnidisksweeper'
# cask 'omnifocus'
# cask 'omnigraffle'
# cask 'omniplan'
cask 'phpstorm'
# cask 'plistedit-pro'
# cask 'pref-setter'
# cask 'preference-manager'
# cask 'private-internet-access'
# Not supported in catalina anymore
#cask 'qbittorrent' -> went for folx (works nicely too)
# cask 'reflector'

# this is a "frozen" cask 
cask 'robo-3t'

#cask 'screaming-frog-seo-spider'
cask 'sequel-pro'
# does not work anymore with Catalina :/ - we'll have to re-check after a while
# I use EasyOnTheEyes now -> via AppStore
#cask 'shades'
cask 'slack'
# cask 'snagit4'
# cask 'sourcetree'
# cask 'sketchup'
cask 'sublime-text'
cask 'sublime-merge-dev'
cask 'suspicious-package'
cask 'teamviewer'
# cask 'telegram'
# cask 'thebrain'
cask 'the-unarchiver'
# cask 'tipp10'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vagrant-vmware-utility'
# this is a "frozen" cask 
#cask 'virtualbox-5.2'
cask 'virtualbox'
# this is a "frozen" cask 
#cask 'virtualbox-extension-pack-5.2'
cask 'virtualbox-extension-pack'
cask 'vlc'
# cask 'whatsapp'
# cask 'wireshark'
cask 'xmind'
cask 'yed'

# apps from the appstore
# mas 'BetterSnapTool', id: 417375580

# is covered by MacOS since MacOS 10.15.1
# mas 'Folder Compare', id: 535348544
# mas 'Get Plain Text', id: 508368068
# mas 'iMovie', id: 408981434
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'XCode', id: 497799835


